# SteelElemPatternIntermediateDistanceY Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemPatternIntermediateDistanceY Property
ParameterTypeId Class See Also
---
"Intermediate distance on side 2"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemPatternIntermediateDistanceY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemPatternIntermediateDistanceY As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemPatternIntermediateDistanceY {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace